--그룹별 검색
--주문테이블에서 주문고객별 주문한 제품의 총주문수량을 검색하시오
SELECT 주문고객, sum(수량) as 총주문수량 from "주문"
    GROUP by 주문고객;

--주문테이블에서 각 주문고객이 주문한 제품의 총 주문수량을 주문제품별로 검색해보자
SELECT 주문제품, 주문고객, sum(수량) as 총주문수량 from "주문"
    GROUP by 주문제품, 주문고객
    ORDER by 주문제품;

--조인 검색
--주문, 제품테이블 조인(부모테이블의 외래키와 자식테이블의 기본키 속성
--주문테입ㄹ과 제품테이블을 조인 검색 하시오
SELECT * FROM 주문, 제품
WHERE 주문제품 = 제품번호;

--주문테이블과 제품테이블을 조인 검색 하시오(주문번호, 주문고객, 제품명, 단가, 제조업체)
SELECT 주문번호, 주문고객, 제품명, 단가, 제조업체 from 주문, 제품
WHERE 주문제품 = 제품번호;

--주문테이블과 제품, 고객테이블을 조인검색하시오(주문번호, 주문고객, 고객이름, 제품명, 단가, 수량, 제조업체만 출력)
SELECT 주문번호, 주문고객, 고객이름, 제품명, 단가, 수량, 제조업체 from 주문, 제품, 고객
WHERE 주문제품 = 제품번호 and 주문고객 = 고객아이디;

-- apple 고객이 주문한 제품의 이름을 검색하시오
SELECT 주문고객, 제품명
from 제품 , 주문
WHERE 제품번호 = 주문제품 and 주문고객 = 'banana';

--감자만두를 주문한 고객의 이름을 검색하시오
SELECT 고객이름
from "고객", "제품", "주문"
WHERE 주문제품 = 제품번호 and 주문고객 = 고객아이디 and 제품명 = '감자만두';

SELECT 고객아이디, 고객이름, 나이, 등급, 직업, 적립금, 제품번호, 제품명, 단가, 수량, 배송지, 주문일자
from "고객", "제품", "주문"
WHERE 주문제품 = 제품번호 and 주문고객 = 고객아이디 and 제품명 = '감자만두';

--나이가 25세 이상인 고객이 주문한 제품의 번호, 주문일자, 고객이름을 검색하시오
SELECT 주문제품, 주문일자, 고객이름
FROM 주문, 고객
WHERE 고객아이디 = 주문고객 and 나이 >= 25
ORDER BY 주문제품;

--고명석 고객이 주문한 제품의 제품명을 검색하시오
SELECT 고객이름, 제품명
FROM 고객, 제품,주문
WHERE 주문제품 = 제품번호 and 주문고객 = 고객아이디 and 고객이름 = '고명석';

--김선우 고객이 주문한 제품의 제품명을 검색하시오
SELECT 고객이름, 제품명
FROM 고객, 제품, 주문
WHERE 주문제품 = 제품번호 and 주문고객 = 고객아이디 and 고객이름='김선우';

--정소화 고객이 주문한 제품의 제품명을 검색하시오.(단, 제품명이 한번씩만 나오게 하시오)
SELECT DISTINCT 고객이름, 제품명
FROM 고객, 제품, 주문
WHERE 주문제품 = 제품번호 and 주문고객 = 고객아이디 and 고객이름='정소화';

--내부조인(inner join)
--고객이 주문한 제품의 번호와 주문일자를 검색하시오. 단, 내부조인 사용
SELECT 주문제품, 주문일자
from 주문 inner join 고객
on 고객아이디 = 주문고객;

--고객의 성이 정 또는 김 또는 고인 고객이 주문한 제품의 번호와 주문일자를 검색하시오. 단, 내부조인 사용
SELECT 고객이름,주문제품, 주문일자
from 주문 inner join 고객
on 고객아이디 = 주문고객
where 고객이름 like '정%' or 고객이름 like '김%' or 고객이름 like '고%';

--외부조인(outer join)
--주문하지 않은 고객도 포함해서 고객이름, 주문제품, 주문일자를 검색하시오
SELECT 고객이름, 주문제품, 주문일자
FROM 고객 LEFT OUTER JOIN 주문 on 고객아이디 = 주문고객; //왼쪽 내부조인

SELECT 고객이름, 주문제품, 주문일자
FROM 주문 RIGHT OUTER JOIN 고객 on 고객아이디 = 주문고객;

SELECT 고객이름, 주문제품, 주문일자 //자연조인
FROM 고객, 주문
WHERE 고객아이디 = 주문고객;

--Sub Query(부속 질의문)
--달콤비스킷 제조업체가 만든 제품명 전부 출력
SELECT 제품명, 단가
FROM 제품
WHERE 제조업체 = (SELECT 제조업체
                FROM 제품
                WHERE 제품명 = '달콤비스킷');

--집계함수를 이용한 서브쿼리
--적립금이 가장많은 고객의 고객이름과 적립금을 검색해보자
SELECT 고객이름, 적립금
FROM 고객
WHERE 적립금 = (SELECT MIN(적립금)
                FROM 고객);

--다중합 부속질의문
--BANANA 고객이 주문한 재품의 제품명, 제조업체를 검색하시오
SELECT 제품명, 제조업체
FROM 제품
WHERE 제품번호 IN (SELECT 주문제품
                FROM 주문
                WHERE 주문고객 = 'banana');

--'banana' 고객이 주문하지않은 제품 검색
SELECT 제품명, 제조업체
FROM 제품
WHERE 제품번호 NOT IN (SELECT 주문제품
                FROM 주문
                WHERE 주문고객 = 'banana');

--대한식품이 제조한 모든 제품의 단가보다 비싼 제품의 제품명, 단가, 제조업체를 검색하시오
SELECT 제품명, 단가, 제조업체
FROM "제품"
WHERE 단가 > ALL (SELECT 단가
                FROM 제품
                WHERE 제조업체 = '대한식품');